luyaohan1001/stm32f401-projects/usb-cdc-device/application-library/usb-cdc-device.c
  if (hcdc->TxState != 0){
    return USBD_BUSY;
  }
  USBD_CDC_SetTxBuffer(&hUsbDeviceFS, Buf, Len);
  result = USBD_CDC_TransmitPacket(&hUsbDeviceFS);
  /* USER CODE END 7 */
  return result;
}

/**
  * @brief  Data transmitted callback
  *         This function is IN transfer complete callback used to inform user that
  *         the submitted Data is successfully sent over USB.
  * @param  Buf: Buffer of data to be received
  * @param  Len: Number of data received (in bytes)
  * @retval Result of the operation: USBD_OK if all operations are OK else USBD_FAIL
  */
int8_t CDC_TransmitCplt_FS(uint8_t *Buf, uint32_t *Len, uint8_t epnum)
{
  uint8_t result = USBD_OK;
  /* USER CODE BEGIN 13 */
  UNUSED(Buf);
  UNUSED(Len);
  UNUSED(epnum);
  /* USER CODE END 13 */
  return result;
}

/* usbd_cdc_if.c END ---- ---- ---- ---- */



/* usb_device.c BEGIN ---- ---- ---- ---- */

/**
  * @brief Init USB device Library, add supported class and start the library
  */
void usb_device_init(void)
{
  /* Init Device Library, add supported class and start the library. */
  // 1. USBD_Init(&p_usbd_handle, &FS_Desc, DEVICE_FS);
  /* Unlink previous class*/
  p_usbd_handle->pClass = NULL;
  p_usbd_handle->pUserData[0] = NULL;
  p_usbd_handle->pConfDesc = NULL;

  /* Assign USBD Descriptors */
  p_usbd_handle->pDesc = &FS_Desc;

  /* Set Device initial State */
  p_usbd_handle->dev_state = USBD_STATE_DEFAULT;  // DEFAULT - ADDRESSED - CONFIGURED - SUSPEND
  p_usbd_handle->id = DEVICE_FS; // DEVICE_FS (0)

  /* Initialize low level driver */
  // USBD_LL_Init(p_usbd_handle); // configure the TX or the RX FIFO of the new defined endport
                                  // From usbd_conf.c expanded below. 

  /* Init USB Ip. */
  extern PCD_HandleTypeDef hpcd_USB_OTG_FS;
  if (p_usbd_handle->id == DEVICE_FS) {
  /* Link the driver to the stack. */
  hpcd_USB_OTG_FS.pData = p_usbd_handle;
                                           /* pData is the pointer to upper stack handler. */
  p_usbd_handle->pData = &hpcd_USB_OTG_FS; /* connect usbd_handle with the lower-level pcd_handle*/

  hpcd_USB_OTG_FS.Instance = USB_OTG_FS;
  hpcd_USB_OTG_FS.Init.dev_endpoints = 4;
  hpcd_USB_OTG_FS.Init.speed = PCD_SPEED_FULL;
  hpcd_USB_OTG_FS.Init.dma_enable = DISABLE;
  hpcd_USB_OTG_FS.Init.phy_itface = PCD_PHY_EMBEDDED;
  hpcd_USB_OTG_FS.Init.Sof_enable = DISABLE;
  hpcd_USB_OTG_FS.Init.low_power_enable = DISABLE;
  hpcd_USB_OTG_FS.Init.lpm_enable = DISABLE;
  hpcd_USB_OTG_FS.Init.vbus_sensing_enable = DISABLE;
  hpcd_USB_OTG_FS.Init.use_dedicated_ep1 = DISABLE;

  HAL_PCD_Init(&hpcd_USB_OTG_FS);
  /* in stm32f4xx_hal_pcd_ex.h */ 
  HAL_PCDEx_SetRxFiFo(&hpcd_USB_OTG_FS, 0x80);    /* set RX FIFO size 0x80*/
  HAL_PCDEx_SetTxFiFo(&hpcd_USB_OTG_FS, 0, 0x40); /* set TX FIFO 0 with size 0x40 */ 
  HAL_PCDEx_SetTxFiFo(&hpcd_USB_OTG_FS, 1, 0x80); /* set TX FIFO 1 with size 0x80 */
  }
  /*---------------------------------------------------------------------------*/
  // 2. USBD_RegisterClass(&p_usbd_handle, &USBD_CDC); // usbd_core.c
  
  /* link the class to the USB Device handle */
  p_usbd_handle->pClass = &USBD_CDC;

  /* Get Device Configuration Descriptor */
  /*
  uint16_t len = 0U;
  if (p_usbd_handle->pClass[p_usbd_handle->classId]->GetFSConfigDescriptor != NULL)
  {
    // pClass is of type USBD_ClassTypeDef.
    // p_usbd_handle is of type USBD_HandleTypeDef
    // The actual GetFSConfigDescriptor is implemented as  USBD_CDC_GetFSCfgDesc(uint16_t *length) in usbd_cdc.c
    p_usbd_handle->pConfDesc = (void *)p_usbd_handle->pClass[p_usbd_handle->classId]->GetFSConfigDescriptor(&len);
  }
  */
  // p_usbd_handle->pConfDesc = (void *)p_usbd_handle->pClass[p_usbd_handle->classId]->GetFSConfigDescriptor(0);
  // p_usbd_handle->pConfDesc = (void *)p_usbd_handle->pClass->GetFSConfigDescriptor(0); 
  /* p_usbd_handle->pClass = (USBD_CDC)*/
  p_usbd_handle->pConfDesc = (&USBD_CDC)->GetFSConfigDescriptor(0) ;

  /* Increment the NumClasses */
  // p_usbd_handle->NumClasses ++;

  // 3. USBD_CDC_RegisterInterface(&p_usbd_handle, &USBD_Interface_fops_FS);
  p_usbd_handle->pUserData[p_usbd_handle->classId] = &USBD_Interface_fops_FS;

  // 4. USBD_Startp_usbd_handle;
  // HAL_PCD_Start(p_usbd_handle->pData);  /* p_usbd_handle->pData has type void */
                                           /* pData = hpcd_USB_OTG_FS was assigned in step 1. USBD_LL_Init */
  HAL_PCD_Start(&hpcd_USB_OTG_FS);
}
/* usb_device.c END ---- ---- ---- ---- */



/* usbd_cdc.c START ---- ---- ---- ---- */
/**
  * @brief  Initialize the CDC interface
  * @param  pdev: device instance
  * @param  cfgidx: Configuration index
  * @retval status
  */
uint8_t USBD_CDC_Init(USBD_HandleTypeDef *pdev, uint8_t cfgidx)
{
  UNUSED(cfgidx);
  USBD_CDC_HandleTypeDef *hcdc;

  hcdc = (USBD_CDC_HandleTypeDef *)USBD_malloc(sizeof(USBD_CDC_HandleTypeDef));

  if (hcdc == NULL)
  {
    pdev->pClassDataCmsit[pdev->classId] = NULL;
    return (uint8_t)USBD_EMEM;
  }

  memset(hcdc, 0, sizeof(USBD_CDC_HandleTypeDef));

  pdev->pClassDataCmsit[pdev->classId] = (void *)hcdc;
  pdev->pClassData = pdev->pClassDataCmsit[pdev->classId];

  /* High Speed */
  if (pdev->dev_speed == USBD_SPEED_HIGH)
  {
    /* Open EP IN */
    USBD_LL_OpenEP(pdev, CDC_IN_EP, USBD_EP_TYPE_BULK,
                         CDC_DATA_HS_IN_PACKET_SIZE);

    pdev->ep_in[CDC_IN_EP & 0xFU].is_used = 1U;

    /* Open EP OUT */
    USBD_LL_OpenEP(pdev, CDC_OUT_EP, USBD_EP_TYPE_BULK,
                         CDC_DATA_HS_OUT_PACKET_SIZE);

    pdev->ep_out[CDC_OUT_EP & 0xFU].is_used = 1U;

    /* Set bInterval for CDC CMD Endpoint */
    pdev->ep_in[CDC_CMD_EP & 0xFU].bInterval = CDC_HS_BINTERVAL;
  }
  /* Low/Full Speed */
  else
  {
    /* Open EP IN */
    USBD_LL_OpenEP(pdev, CDC_IN_EP, USBD_EP_TYPE_BULK,
                         CDC_DATA_FS_IN_PACKET_SIZE);

    pdev->ep_in[CDC_IN_EP & 0xFU].is_used = 1U;

    /* Open EP OUT */
    USBD_LL_OpenEP(pdev, CDC_OUT_EP, USBD_EP_TYPE_BULK,
                         CDC_DATA_FS_OUT_PACKET_SIZE);

    pdev->ep_out[CDC_OUT_EP & 0xFU].is_used = 1U;

    /* Set bInterval for CMD Endpoint */
    pdev->ep_in[CDC_CMD_EP & 0xFU].bInterval = CDC_FS_BINTERVAL;
  }

  /* Open Command IN EP */
  USBD_LL_OpenEP(pdev, CDC_CMD_EP, USBD_EP_TYPE_INTR, CDC_CMD_PACKET_SIZE);
  pdev->ep_in[CDC_CMD_EP & 0xFU].is_used = 1U;

  hcdc->RxBuffer = NULL;

  /* Init  physical Interface components */
  ((USBD_CDC_ItfTypeDef *)pdev->pUserData[pdev->classId])->Init();

